app/models/user.rb

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0QNKPl3dW-ebo4XSBP0Wkg"], ["updated_at", "2019-10-07 19:49:37.626203"], ["id", 4]]